Autodesk.Revit.UI.ProjectBrowserOptions.GetProjectBrowserOptions
Returns the current Revit instance's ProjectBrowserOptions.
Returns:
The ProjectBrowserOptions for the current Revit instance.
Since:
2023

Autodesk.Revit.UI.ProjectBrowserOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ProjectBrowserOptions.ShowViewPlacementOnSheetStatusIcons
Show the icons indicating view placement on sheet status.
Remarks:
If true, the icons indicating view placement on sheet status will be shown at every view or schedule node in the Project Browser.
If false, the icons indicating view placement on sheet status will not be shown.
Since:
2023

Autodesk.Revit.UI.ProjectBrowserOptions
Provides access to settings that control Revit's Project Browser appearance and functionality.
Remarks:
These settings are stored in the Revit.ini file.  All documents in Revit instances which use this Revit.ini will follow these settings.
Since:
2023